using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/*
    1.Изменить программу вывода таблицы функции так, чтобы можно было передавать функции типа double (double, double). 
    Продемонстрировать работу на функции с функцией a*x^2 и функцией a*sin(x).
 
    2.Модифицировать программу нахождения минимума функции так, чтобы можно было передавать функцию в виде делегата. 
 
    а) Сделать меню с различными функциями и представить пользователю выбор, для какой функции и на каком отрезке находить минимум. 
    Использовать массив (или список) делегатов, в котором хранятся различные функции.

    б) *Переделать функцию Load, чтобы она возвращала массив считанных значений. Пусть она возвращает минимум через параметр (с использованием модификатора out). 
 
    3.Переделать программу Пример использования коллекций для решения следующих задач:
    а) Подсчитать количество студентов учащихся на 5 и 6 курсах;
    б) подсчитать сколько студентов в возрасте от 18 до 20 лет на каком курсе учатся (*частотный массив);
    в) отсортировать список по возрасту студента;
    г) *отсортировать список по курсу и возрасту студента;
    
    4.**Считайте файл различными способами. Смотрите “Пример записи файла различными способами”. Создайте методы, которые возвращают массив byte (FileStream, BufferedStream), строку для StreamReader и массив int для BinaryReader.

 * */

namespace lesson_6
{
    class MainClass
    {
        static void Main(string[] args)
        {

        }
    }
}
